GHB2/src/InformationRegisters/гхб_РаспределениеДоступовВПомещенияЮридическиеЛица/гхб_РаспределениеДоступовВПомещенияЮридическиеЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гхб_РаспределениеДоступовВПомещенияЮридическиеЛица</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>Площадь</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Закрыть</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УточняющаяИнформация</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Помещение</name>
    <type>
      <types>CatalogRef.гхб_Помещения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЮридическоеЛицо</name>
    <type>
      <types>CatalogRef.гхб_ОрганизацииБазХолдинга</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дивизион</name>
    <type>
      <types>CatalogRef.гхб_Дивизионы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Департамент</name>
    <type>
      <types>CatalogRef.гхб_ПодразделенияОрганизацийБазХолдинга</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

GHB2/src/InformationRegisters/гхб_РаспределениеДоступовВПомещенияЮридическиеЛица/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ВернутьДанныеПоПомещению(_Помещение) Экспорт 
	
	_Массив = Новый Массив();
	
	Если ЗначениеЗаполнено(_Помещение) Тогда
	
		Запрос = Новый Запрос();
		Запрос.Текст = "ВЫБРАТЬ
		               |	гхб_РаспределениеДоступовВПомещенияЮридическиеЛицаСрезПоследних.Помещение КАК Помещение,
		               |	гхб_РаспределениеДоступовВПомещенияЮридическиеЛицаСрезПоследних.ЮридическоеЛицо КАК ЮридическоеЛицо,
		               |	гхб_РаспределениеДоступовВПомещенияЮридическиеЛицаСрезПоследних.Площадь КАК Площадь,
		               |	гхб_РаспределениеДоступовВПомещенияЮридическиеЛицаСрезПоследних.УточняющаяИнформация КАК УточняющаяИнформация,
		               |	гхб_РаспределениеДоступовВПомещенияЮридическиеЛицаСрезПоследних.Дивизион КАК Дивизион,
		               |	гхб_РаспределениеДоступовВПомещенияЮридическиеЛицаСрезПоследних.Департамент КАК Департамент
		               |ИЗ
		               |	РегистрСведений.гхб_РаспределениеДоступовВПомещенияЮридическиеЛица.СрезПоследних(, Помещение = &Помещение) КАК гхб_РаспределениеДоступовВПомещенияЮридическиеЛицаСрезПоследних
		               |ГДЕ
		               |	НЕ гхб_РаспределениеДоступовВПомещенияЮридическиеЛицаСрезПоследних.Закрыть";
		
		Запрос.УстановитьПараметр("Помещение", _Помещение);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			_Структура = Новый Структура();
			_Структура.Вставить("Помещение", Выборка.Помещение);
			_Структура.Вставить("ЮридическоеЛицо", Выборка.ЮридическоеЛицо);
			_Структура.Вставить("Площадь", Выборка.Площадь);
			_Структура.Вставить("УточняющаяИнформация", Выборка.УточняющаяИнформация);
			_Структура.Вставить("Дивизион", Выборка.Дивизион);
			_Структура.Вставить("Департамент", Выборка.Департамент);
				
			_Массив.Добавить(_Структура);
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат _Массив;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли
